# Python used to clean data, then analyse it using 
# "Calculated Columns" and "Measures" to look at 
# sale price and profit

In [1]:
# importing packages
import pandas as pd
from IPython.display import display, HTML
# Extending the width of the display
display(HTML("<style>.container { width:100% !important; }</style>"))

# Upload the “CarSalesData” table

In [2]:
# Upload data from local file called 'CarSalesData.csv'
car_sales = pd.read_csv('CarSalesData.csv')

# Clean the data : Remove all rows containing null values

In [3]:
# Find how many null values there are
car_sales.isna().sum()

CarSaleID        0
Brand            0
Model            0
BuyingPrice      9
SellingPrice    17
dtype: int64

In [4]:
# Remove all rows containing null values
car_sales.dropna(inplace=True)

In [5]:
# Check nulls have been removed
car_sales.isna().sum()

CarSaleID       0
Brand           0
Model           0
BuyingPrice     0
SellingPrice    0
dtype: int64

In [6]:
# Check
car_sales

    CarSaleID     Brand              Model  BuyingPrice  SellingPrice
1           2      Ford            Festiva     41107.23       8529.54
2           3  Cadillac                XLR     24982.65       4048.91
3           4  Cadillac           Eldorado      1599.61      83575.23
5           6    Corbin            Sparrow     45533.84      66986.16
6           7       GMC             Canyon      9408.15      65708.52
..        ...       ...                ...          ...           ...
94         95      Ford            Mustang     14674.94      12010.62
95         96       GMC  Sonoma Club Coupe      4214.93      24509.82
96         97    Subaru              Leone     44519.55      37449.81
97         98      Ford            Contour      7116.29      29959.23
98         99     Dodge            Daytona     21005.42      50325.66

[76 rows x 5 columns]

In [7]:
# Reset the index, drop the current index and keep hold of the new index
car_sales.reset_index(drop=True, inplace=True)

In [8]:
# Check
car_sales

    CarSaleID     Brand              Model  BuyingPrice  SellingPrice
0           2      Ford            Festiva     41107.23       8529.54
1           3  Cadillac                XLR     24982.65       4048.91
2           4  Cadillac           Eldorado      1599.61      83575.23
3           6    Corbin            Sparrow     45533.84      66986.16
4           7       GMC             Canyon      9408.15      65708.52
..        ...       ...                ...          ...           ...
71         95      Ford            Mustang     14674.94      12010.62
72         96       GMC  Sonoma Club Coupe      4214.93      24509.82
73         97    Subaru              Leone     44519.55      37449.81
74         98      Ford            Contour      7116.29      29959.23
75         99     Dodge            Daytona     21005.42      50325.66

[76 rows x 5 columns]

# Continue cleaning the data : Check for duplicates

In [9]:
# Get a list of duplicates
duplicates = car_sales.duplicated()

In [10]:
# Duplicate rows are indicated by True in 'duplicates' dataframe.
# max() will return True if there are any True values in 'duplicates'.
max(duplicates)

False

# Continue cleaning the data : Check if 
# data types of each column are correct
# e.g. If BuyingPrice is a number, not a string

In [11]:
car_sales.dtypes

CarSaleID         int64
Brand            object
Model            object
BuyingPrice     float64
SellingPrice    float64
dtype: object

# Adding a "Calculated column".  
# Add a new column called “Profit” which will be the
# subtraction of the “BuyingPrice” column from the 
# “SellingPrice” column.

In [12]:
car_sales['Profit'] = car_sales['SellingPrice'] - car_sales['BuyingPrice']

In [13]:
# Check
car_sales

,CarSaleID,Brand,Model,BuyingPrice,SellingPrice,Profit
0,2,Ford,Festiva,41107.23,8529.54,-32577.69
1,3,Cadillac,XLR,24982.65,4048.91,-20933.74
2,4,Cadillac,Eldorado,1599.61,83575.23,81975.62
3,6,Corbin,Sparrow,45533.84,66986.16,21452.32
4,7,GMC,Canyon,9408.15,65708.52,56300.37
...,...,...,...,...,...,...
71,95,Ford,Mustang,14674.94,12010.62,-2664.32
72,96,GMC,Sonoma Club Coupe,4214.93,24509.82,20294.89
73,97,Subaru,Leone,44519.55,37449.81,-7069.74
74,98,Ford,Contour,7116.29,29959.23,22842.94
75,99,Dodge,Daytona,21005.42,50325.66,29320.24

# Adding a "Calculated column".  
# Add a new column called “MadeProfit” which will be
# True if the car was sold for more than it was bought,
#  and False otherwise

In [14]:
# Add a column called "MadeProfit", and initialise all its values to "True"
car_sales['MadeProfit'] = True

# Fill the new column
for row_index in range(car_sales.shape[0]):
    # Set to False if the car sold for less than it was bought
    if car_sales['Profit'][row_index] <= 0 :
        car_sales.loc[row_index, 'MadeProfit'] = False

In [15]:
# Check
car_sales

,CarSaleID,Brand,Model,BuyingPrice,SellingPrice,Profit,MadeProfit
0,2,Ford,Festiva,41107.23,8529.54,-32577.69,False
1,3,Cadillac,XLR,24982.65,4048.91,-20933.74,False
2,4,Cadillac,Eldorado,1599.61,83575.23,81975.62,True
3,6,Corbin,Sparrow,45533.84,66986.16,21452.32,True
4,7,GMC,Canyon,9408.15,65708.52,56300.37,True
...,...,...,...,...,...,...,...
71,95,Ford,Mustang,14674.94,12010.62,-2664.32,False
72,96,GMC,Sonoma Club Coupe,4214.93,24509.82,20294.89,True
73,97,Subaru,Leone,44519.55,37449.81,-7069.74,False
74,98,Ford,Contour,7116.29,29959.23,22842.94,True
75,99,Dodge,Daytona,21005.42,50325.66,29320.24,True

# Adding some "Measures".  
# Calculate the average sales, average profit
# and total profit.

In [16]:
average_sales = car_sales['SellingPrice'].mean()
average_sales

49770.32960526316

In [17]:
average_profit = car_sales['Profit'].mean()
average_profit

26072.268684210525

In [18]:
total_profit = car_sales['Profit'].sum()
total_profit

1981492.42

# Save data to csv file

In [19]:
# Save data to local file called 'ProcessedCarSalesData.csv'
car_sales.to_csv('ProcessedCarSalesData.csv', index=False)